app/controllers/posts_controller.rb

SELECT "authors".* FROM "authors"
SELECT "posts".* FROM "posts" WHERE (created_at >='2016-01-27 00:00:00.000000')
---
  def index
    # provide a list of authors to the view for the filter control
    @authors = Author.all

    # filter the @posts list based on user input
    if !params[:author].blank?
      @posts = Post.by_author(params[:author]) #author_id taken
    elsif !params[:date].blank?
      if params[:date] == "Today"
        @posts = Post.from_today
      else
        # put where("created_at <?", Time.zone.today.beginning_of_day) to model
        @posts = Post.old_news
      end
    else
      # if no filters are applied, show all posts
      @posts = Post.all